#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.python_lambda_package: Reading...
data.archive_file.python_lambda_package: Read complete after 0s [id=e4631ffb0969c624a0d3c194e9132df1686fef48]
data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
aws_ssm_parameter.foo: Refreshing state... [id=foo]
data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-lambdaRole-waf]
aws_lambda_function.hello_lambda_function: Refreshing state... [id=HelloWorld]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cloudwatch_rule will be created
  + resource "aws_cloudwatch_event_rule" "cloudwatch_rule" {
      + arn            = (known after apply)
      + description    = "Alarms based on ec2 events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = [
                      + "running",
                      + "terminating",
                    ]
                }
              + detail-type = [
                  + "EC2 Instance Launch/terminate Successful",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "cloudwatch-rule-lambda"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.ec2_cloudevent_target will be created
  + resource "aws_cloudwatch_event_target" "ec2_cloudevent_target" {
      + arn            = "arn:aws:lambda:us-east-2:456639116688:function:HelloWorld"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "cloudwatch-rule-lambda"
      + target_id      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Moglius, Action: `pull_request`*